swat-dp-tools/soma/xml/service-probe-enable.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:dp="http://www.datapower.com/schemas/management">
    <soapenv:Body>
        <dp:request domain="@domain.name@">
            <dp:modify-config>
                <XMLFirewallService name="@service.object.name@">
                    <DebugMode>off</DebugMode>
                </XMLFirewallService>
            </dp:modify-config>
        </dp:request>
    </soapenv:Body>
</soapenv:Envelope>